mixly/SMeshStudio/smeshcore/hardware/mbed/boards.txt

xbed_lpc1768_gcc_arm.name=xbed  LPC1768 make by gcc_arm and upload by flashmagic 
xbed_lpc1768_gcc_arm.upload.protocol=flashmagic
xbed_lpc1768_gcc_arm.upload.tool=mbed_fm
xbed_lpc1768_gcc_arm.build.mcu=cortex-m3
xbed_lpc1768_gcc_arm.build.cpu=LPC1768

xbed_lpc1768_gcc_arm.build.architecture=arm-none-eabi
xbed_lpc1768_gcc_arm.build.command.as=arm-none-eabi-as
xbed_lpc1768_gcc_arm.build.command.gcc=arm-none-eabi-gcc
xbed_lpc1768_gcc_arm.build.command.g++=arm-none-eabi-g++
xbed_lpc1768_gcc_arm.build.command.ar=arm-none-eabi-ar
xbed_lpc1768_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
xbed_lpc1768_gcc_arm.build.command.objdump=arm-none-eabi-objdump
xbed_lpc1768_gcc_arm.build.command.size=arm-none-eabi-size

xbed_lpc1768_gcc_arm.build.core=mbed
xbed_lpc1768_gcc_arm.build.variant=xbed1.0_lpc1768_gcc_arm


xbed_lpc1768_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m3 -mthumb -c -Os -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fno-strict-aliasing -Wno-unused-function -Wno-unused-variable 
xbed_lpc1768_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
xbed_lpc1768_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98
xbed_lpc1768_gcc_arm.build.CC_SYMBOLS = -DTARGET_LPC1768 -DTARGET_M3 -DTARGET_NXP -DTARGET_LPC176X -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3 -DUIP_CONF_IPV6=1 -DHAVE_STDINT_H -DRF230BB=1 -DAUTOSTART_ENABLE=1 -DPROJECT_CONF_H=\"project-conf.h\" -DCONTIKI=1
xbed_lpc1768_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
xbed_lpc1768_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

xbed_lpc1768_gcc_arm.build.ldscript=hardware/mbed/variants/xbed1.0_lpc1768_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC176X/TOOLCHAIN_GCC_ARM/LPC1768.ld

xbed_lpc1768_gcc_arm.build.use_archiver=false
xbed_lpc1768_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
xbed_lpc1768_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
xbed_lpc1768_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
xbed_lpc1768_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
xbed_lpc1768_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/xbed1.0_lpc1768_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC176X/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
xbed_lpc1768_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
xbed_lpc1768_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
xbed_lpc1768_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_arch_lpc11u24_gcc_arm.name=Seeed Arch mbed LPC11U24 make by gcc_arm 
mbed_arch_lpc11u24_gcc_arm.upload.protocol=copy
mbed_arch_lpc11u24_gcc_arm.upload.tool=mbed_cp
mbed_arch_lpc11u24_gcc_arm.build.mcu=cortex-m0
mbed_arch_lpc11u24_gcc_arm.build.cpu=LPC11U24

mbed_arch_lpc11u24_gcc_arm.build.architecture=arm-none-eabi
mbed_arch_lpc11u24_gcc_arm.build.command.as=arm-none-eabi-as
mbed_arch_lpc11u24_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_arch_lpc11u24_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_arch_lpc11u24_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_arch_lpc11u24_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_arch_lpc11u24_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_arch_lpc11u24_gcc_arm.build.command.size=arm-none-eabi-size

mbed_arch_lpc11u24_gcc_arm.build.core=mbed
mbed_arch_lpc11u24_gcc_arm.build.variant=mbed_arch_lpc11u24_gcc_arm

mbed_arch_lpc11u24_gcc_arm.build.CC_FLAGS=-mcpu=cortex-m0 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -DNDEBUG  -Os  -Wno-unused-function -Wno-unused-variable
mbed_arch_lpc11u24_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_arch_lpc11u24_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98  -fno-rtti
mbed_arch_lpc11u24_gcc_arm.build.CC_SYMBOLS = -DTARGET_LPC11U24 -DTARGET_M0 -DTARGET_NXP -DTARGET_LPC11UXX -DTARGET_LPC11U24_401 -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0 -DARM_MATH_CM0 -DMBED_BUILD_TIMESTAMP=1415006910.97 -D__MBED__=1 
mbed_arch_lpc11u24_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m0 -mthumb -Wl,--gc-sections --specs=nano.specs
mbed_arch_lpc11u24_gcc_arm.build.LD_SYS_LIBS =-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_arch_lpc11u24_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_arch_lpc11u24_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11UXX/TOOLCHAIN_GCC_ARM/TARGET_LPC11U24_401/LPC11U24.ld

mbed_arch_lpc11u24_gcc_arm.build.use_archiver=false
mbed_arch_lpc11u24_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_lpc11u24_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_arch_lpc11u24_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_arch_lpc11u24_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_arch_lpc11u24_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_arch_lpc11u24_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11UXX/TOOLCHAIN_GCC_ARM/TARGET_LPC11U24_401" {build.LD_SYS_LIBS}
mbed_arch_lpc11u24_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_arch_lpc11u24_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_arch_lpc11u24_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_xdow_lpc11u35_gcc_arm.name=Seeed XDOW mbed LPC11U35 make by gcc_arm 
mbed_xdow_lpc11u35_gcc_arm.upload.protocol=copy
mbed_xdow_lpc11u35_gcc_arm.upload.tool=mbed_cp
mbed_xdow_lpc11u35_gcc_arm.build.mcu=cortex-m0
mbed_xdow_lpc11u35_gcc_arm.build.cpu=LPC11U35

