mixly/SMeshStudio/smeshcore/hardware/mbed/boards.txt
###################################################################################################################
mbed_lpc1549_gcc_arm.name=mbed LPC1549 LPCXpresso make by gcc_arm and upload by copy 
mbed_lpc1549_gcc_arm.upload.protocol=copy
mbed_lpc1549_gcc_arm.upload.tool=mbed_cp
mbed_lpc1549_gcc_arm.build.mcu=cortex-m3
mbed_lpc1549_gcc_arm.build.cpu=lpc1549

mbed_lpc1549_gcc_arm.build.architecture=arm-none-eabi
mbed_lpc1549_gcc_arm.build.command.as=arm-none-eabi-as
mbed_lpc1549_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_lpc1549_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_lpc1549_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_lpc1549_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_lpc1549_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_lpc1549_gcc_arm.build.command.size=arm-none-eabi-size

mbed_lpc1549_gcc_arm.build.core=mbed
mbed_lpc1549_gcc_arm.build.variant=mbed_lpc1549_gcc_arm

mbed_lpc1549_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m3 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer  -Wno-unused-function -Wno-unused-variable -MMD -MP
mbed_lpc1549_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_lpc1549_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_lpc1549_gcc_arm.build.CC_SYMBOLS = -DTARGET_LPC1549 -DTARGET_M3 -DTARGET_NXP -DTARGET_LPC15XX -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3 -DMBED_BUILD_TIMESTAMP=1414315787.71 -D__MBED__=1 -DTARGET_FF_ARDUINO 
mbed_lpc1549_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_lpc1549_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_lpc1549_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_lpc1549_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC15XX/TOOLCHAIN_GCC_ARM/lpc1549.ld

mbed_lpc1549_gcc_arm.build.use_archiver=false
mbed_lpc1549_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_lpc1549_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_lpc1549_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_lpc1549_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_lpc1549_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_lpc1549_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC15XX/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_lpc1549_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_lpc1549_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_lpc1549_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_f103rb_gcc_arm.name=  ST Nucleo F103RB mbed boards  by gcc_arm 
mbed_f103rb_gcc_arm.upload.protocol=copy
mbed_f103rb_gcc_arm.upload.tool=mbed_cp
mbed_f103rb_gcc_arm.build.mcu=cortex-m3
mbed_f103rb_gcc_arm.build.cpu=STM32F103RB

mbed_f103rb_gcc_arm.build.architecture=arm-none-eabi
mbed_f103rb_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f103rb_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f103rb_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f103rb_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f103rb_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f103rb_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f103rb_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f103rb_gcc_arm.build.core=mbed
mbed_f103rb_gcc_arm.build.variant=mbed_f103rb_gcc_arm

mbed_f103rb_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m3 -mthumb -c -Os -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -Wno-unused-function -Wno-unused-variable 
mbed_f103rb_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f103rb_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98
mbed_f103rb_gcc_arm.build.CC_SYMBOLS = -DTARGET_STM -DTARGET_M3  -DSTM32F10X_MD  -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M3 -DARM_MATH_CM3  -DSTM32F1 -DSTM32F103RB -DSTM
mbed_f103rb_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m3 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_f103rb_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_f103rb_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_f103rb_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_F103RB/TOOLCHAIN_GCC_ARM/STM32F10X.ld

mbed_f103rb_gcc_arm.build.use_archiver=false
mbed_f103rb_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f103rb_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f103rb_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/xbed1.0_stm32f103_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_F103RB/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f103rb_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f103rb_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f103rb_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

