mixly/SMeshStudio/smeshcore/hardware/mbed/boards.txt
###################################################################################################################
mbed_f401re_gcc_arm.name=  ST Nucleo F401RE mbed boards  by gcc_arm 
mbed_f401re_gcc_arm.upload.protocol=copy
mbed_f401re_gcc_arm.upload.tool=mbed_cp
mbed_f401re_gcc_arm.build.mcu=cortex-m4
mbed_f401re_gcc_arm.build.cpu=STM32f401RE

mbed_f401re_gcc_arm.build.architecture=arm-none-eabi
mbed_f401re_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f401re_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f401re_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f401re_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f401re_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f401re_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f401re_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f401re_gcc_arm.build.core=mbed
mbed_f401re_gcc_arm.build.variant=mbed_f401re_gcc_arm

mbed_f401re_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP
mbed_f401re_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f401re_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f401re_gcc_arm.build.CC_SYMBOLS =  -DTARGET_NUCLEO_F401RE -DTARGET_M4 -DTARGET_STM -DTARGET_STM32F4 -DTARGET_STM32F401RE -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1413962987.25 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_f401re_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_f401re_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_f401re_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_f401re_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f401re/TOOLCHAIN_GCC_ARM/NUCLEO_F401RE.ld

mbed_f401re_gcc_arm.build.use_archiver=false
mbed_f401re_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f401re_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f401re_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f401re_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f401re_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_f401re_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f401re/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f401re_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f401re_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f401re_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_f411re_gcc_arm.name=  ST Nucleo F411RE mbed boards  by gcc_arm 
mbed_f411re_gcc_arm.upload.protocol=copy
mbed_f411re_gcc_arm.upload.tool=mbed_cp
mbed_f411re_gcc_arm.build.mcu=cortex-m4
mbed_f411re_gcc_arm.build.cpu=STM32f411RE

mbed_f411re_gcc_arm.build.architecture=arm-none-eabi
mbed_f411re_gcc_arm.build.command.as=arm-none-eabi-as
mbed_f411re_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_f411re_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_f411re_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_f411re_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_f411re_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_f411re_gcc_arm.build.command.size=arm-none-eabi-size

mbed_f411re_gcc_arm.build.core=mbed
mbed_f411re_gcc_arm.build.variant=mbed_f411re_gcc_arm

mbed_f411re_gcc_arm.build.CC_FLAGS=  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections  -Wno-unused-function -Wno-unused-variable -MMD -MP
mbed_f411re_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_f411re_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_f411re_gcc_arm.build.CC_SYMBOLS =-DTARGET_NUCLEO_F411RE -DTARGET_M4 -DTARGET_STM -DTARGET_STM32F4 -DTARGET_STM32F411RE -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -D__FPU_PRESENT=1 -DMBED_BUILD_TIMESTAMP=1414313260.2 -D__MBED__=1 -DTARGET_FF_ARDUINO -DTARGET_FF_MORPHO 
mbed_f411re_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m4 -mthumb -mfpu=fpv4-sp-d16 -mfloat-abi=softfp -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float -Wl,-Map={build.project_name}.map,--cref
mbed_f411re_gcc_arm.build.LD_SYS_LIBS =   -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_f411re_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_f411re_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f411re/TOOLCHAIN_GCC_ARM/NUCLEO_f411RE.ld

mbed_f411re_gcc_arm.build.use_archiver=false
mbed_f411re_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f411re_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_f411re_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_f411re_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_f411re_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_f411re_gcc_arm/cmsis/TARGET_STM/TARGET_NUCLEO_f411re/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_f411re_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_f411re_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_f411re_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

