mixly/SMeshStudio/smeshcore/hardware/mbed/boards.txt
###################################################################################################################
mbed_kl25z_gcc_arm.name=Freescale FRDM-KL25Z mbed boards by gcc_arm
mbed_kl25z_gcc_arm.upload.protocol=copy
mbed_kl25z_gcc_arm.upload.tool=mbed_cp
mbed_kl25z_gcc_arm.build.mcu=cortex-m0plus
#mbed_kl25z_gcc_arm.build.cpu=MKL25Z128VLK4

mbed_kl25z_gcc_arm.build.architecture=arm-none-eabi
mbed_kl25z_gcc_arm.build.command.as=arm-none-eabi-as
mbed_kl25z_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_kl25z_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_kl25z_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_kl25z_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_kl25z_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_kl25z_gcc_arm.build.command.size=arm-none-eabi-size

mbed_kl25z_gcc_arm.build.core=mbed
mbed_kl25z_gcc_arm.build.variant=mbed_kl25z_gcc_arm


mbed_kl25z_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m0plus -mthumb -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer  -Wno-unused-function -Wno-unused-variable
mbed_kl25z_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_kl25z_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_kl25z_gcc_arm.build.CC_SYMBOLS =-DTARGET_KL25Z -DTARGET_M0P -DTARGET_Freescale -DTARGET_KLXX -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0PLUS -DARM_MATH_CM0PLUS -DMBED_BUILD_TIMESTAMP=1414314557.66 -D__MBED__=1 -DTARGET_FF_ARDUINO 
mbed_kl25z_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m0plus -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_kl25z_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mbed_kl25z_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_kl25z_gcc_arm/cmsis/TARGET_Freescale/TARGET_KLXX/TARGET_KL25Z/TOOLCHAIN_GCC_ARM/MKL25Z4.ld
mbed_kl25z_gcc_arm.build.use_archiver=false
mbed_kl25z_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_kl25z_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_kl25z_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_kl25z_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_kl25z_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_kl25z_gcc_arm/cmsis/TARGET_Freescale/TARGET_KLXX/TARGET_KL25Z/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_kl25z_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_kl25z_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_kl25z_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_k20d50m_gcc_arm.name=Freescale FRDM-K20D50M mbed boards by gcc_arm
mbed_k20d50m_gcc_arm.upload.protocol=copy
mbed_k20d50m_gcc_arm.upload.tool=mbed_cp
mbed_k20d50m_gcc_arm.build.mcu=cortex-m4
mbed_k20d50m_gcc_arm.build.cpu=MK20DX128VLH5

mbed_k20d50m_gcc_arm.build.architecture=arm-none-eabi
mbed_k20d50m_gcc_arm.build.command.as=arm-none-eabi-as
mbed_k20d50m_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_k20d50m_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_k20d50m_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_k20d50m_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_k20d50m_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_k20d50m_gcc_arm.build.command.size=arm-none-eabi-size

mbed_k20d50m_gcc_arm.build.core=mbed
mbed_k20d50m_gcc_arm.build.variant=mbed_k20d50m_gcc_arm


mbed_k20d50m_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m4 -mthumb -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer -Wno-unused-function -Wno-unused-variable
mbed_k20d50m_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_k20d50m_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_k20d50m_gcc_arm.build.CC_SYMBOLS = -DTARGET_K20D50M -DTARGET_M4 -DTARGET_Freescale -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M4 -DARM_MATH_CM4 -DMBED_BUILD_TIMESTAMP=1414914456.54 -D__MBED__=1 
mbed_k20d50m_gcc_arm.build.LD_FLAGS = -mcpu=cortex-m4 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_k20d50m_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_k20d50m_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_k20d50m_gcc_arm/cmsis/TARGET_Freescale/TARGET_k20d50m/TOOLCHAIN_GCC_ARM/MK20D5.ld
mbed_k20d50m_gcc_arm.build.use_archiver=false
mbed_k20d50m_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_k20d50m_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_k20d50m_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_k20d50m_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_k20d50m_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_k20d50m_gcc_arm/cmsis/TARGET_k20d50m/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_k20d50m_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_k20d50m_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_k20d50m_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

